{
  "article": {
    "title": "Lakers acquire Luka Dončić from Mavericks for Anthony Davis in blockbuster, 3-team trade",
    "sub_title": "The trade sends shock waves throughout the NBA with two of the league's top players changing teams.",
    "from": "NBA.com News Services",
    "updated_on": "February 3, 2025 8:40 PM",
    "content": [
      "<span class='wp-caption-text'>Breaking down the details behind Saturday's stunning news that Luka Dončić is heading to the Lakers.</span>",
      "<p><a href='#'>Luka Dončić</a> led Dallas to the NBA Finals last season. Anthony Davis won a championship with the Los Angeles Lakers.</p>",
      "<p>They’re switching teams now — in an absolute blockbuster.</p>",
      "<p><strong>The Mavericks announced Sunday that they have traded Kia NBA MVP candidate Dončić to the Lakers in exchange for 10-time All-Star Davis,</strong> reserve guard Max Christie and a 2029 first-round draft pick.</p>",
      "<p>The three-team deal, in which Los Angeles acquires veteran forwards Maxi Kleber and Markieff Morris, also includes Utah getting Jalen Hood-Schifino and a 2025 second-rounder from both the Mavs and Lakers.</p>",
      "<p><strong>Los Angeles Lakers get:</strong></p>",
      "<ul><li><a href='#'>Luka Dončić</a></li><li><a href='#'>Maxi Kleber</a></li><li><a href='#'>Markieff Morris</a></li></ul>"
    ],
    "related": [
      {
        "title": "5 instant reactions to AD-Luka trade",
        "details": "Two All-NBA players have been swapped for each other in the middle of the season in a"
      },
      {
        "title": "Luka the Laker: NBA world reacts to trade",
        "details": "Hoops fans were left wondering if a viral joke was taking place as news of Luka Dončić being"
      },
      {
        "title": "15 stunning trades in NBA history",
        "details": "While there have been some shocking deals in NBA history, the most recent blockbuster lands"
      },
      {
        "title": "Dear Dallas: Luka thanks 'special' Mavs fans",
        "details": "Mavericks star shares: 'I am leaving a city that will always feel like a home away from home.'"
      }
    ]
  }
}
